Testmodels/java_api_ql_performance.yml
config:
  target: "http://localhost:9091"
  phases:
    - duration: 5
      arrivalRate: 1000
scenarios:
  - flow:
      - post:
          url: "/graphql"
          json:
            query: "mutation { newConversation {   id  }}"
          capture:
            json: "$.data.newConversation.id"
            as: "newMessId"
      - post:
          url: "/graphql"
          json:
            query: 'mutation { createMessage(content: "Hello", convId: "{{newMessId}}") {   id  }}'
      - post:
          url: "/graphql"
          json:
            query: 'query { messages (_id:"{{newMessId}}") { id } }'
      - post:
          url: "/graphql"
          json:
            query: 'mutation { createMessage(content: "Whats up?", convId: "{{newMessId}}") {   id  }}'
      - post:
          url: "/graphql"
          json:
            query: 'query { messages (_id:"{{newMessId}}") { id } }'